/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strtrim.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yokitaga <yokitaga@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/10 16:22:51 by yokitaga          #+#    #+#             */
/*   Updated: 2022/10/10 16:22:52 by yokitaga         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


/*
文字列s1の先頭および終端から、文字列s2に含まれる文字を取り除く。
s1	変更を行う文字列。
s2	取り除く文字を指定する文字列。
戻り値は、文字を取り除いたか否かを表す真偽値である。
*/